In [35]:
import pandas as pd

In [36]:
life_ex=pd.read_json('life_exp_json.json')
life_ex

           country country_code  year  life_exp(years)
0      Afghanistan          AFG  1950           27.638
1      Afghanistan          AFG  1951           27.878
2      Afghanistan          AFG  1952           28.361
3      Afghanistan          AFG  1953           28.852
4      Afghanistan          AFG  1954           29.350
...            ...          ...   ...              ...
18440     Zimbabwe          ZWE  2015           59.534
18441     Zimbabwe          ZWE  2016           60.294
18442     Zimbabwe          ZWE  2017           60.812
18443     Zimbabwe          ZWE  2018           61.195
18444     Zimbabwe          ZWE  2019           61.490

[18445 rows x 4 columns]

In [37]:
life_ex_2017= life_ex[life_ex['year'] == 2017]

In [38]:
life_ex_2017.head()

            country country_code  year  life_exp(years)
67      Afghanistan          AFG  2017           64.130
137         Albania          ALB  2017           78.333
210         Algeria          DZA  2017           76.499
280  American Samoa          ASM  2017           73.636
350         Andorra          AND  2017           83.443

In [39]:
life_ex_2017.to_json

<bound method NDFrame.to_json of               country country_code  year  life_exp(years)
67        Afghanistan          AFG  2017           64.130
137           Albania          ALB  2017           78.333
210           Algeria          DZA  2017           76.499
280    American Samoa          ASM  2017           73.636
350           Andorra          AND  2017           83.443
...               ...          ...   ...              ...
18155  Western Sahara          ESH  2017           69.762
18232           World     OWID_WRL  2017           72.169
18302           Yemen          YEM  2017           66.086
18372          Zambia          ZMB  2017           63.043
18442        Zimbabwe          ZWE  2017           60.812

[235 rows x 4 columns]>

In [41]:
life_ex_2017.to_json("life_ex_2017.json")